app/views/users/two_factor.html.erb

SELECT COUNT(*) FROM "trusted_devices" WHERE "trusted_devices"."user_id" = 1 AND (expires_at > '2026-02-06 20:21:57.415430')
---

      <% active_devices_count = @user.trusted_devices.active.count %>