app/controllers/entries_controller.rb

  def index
    @entries = current_user.entries

    # Text search (searches across writer, address, notes) - case insensitive
    if params[:query].present?
      search_query = "%#{params[:query].downcase}%"
      @entries = @entries.where(
        "LOWER(writer_name) LIKE ? OR LOWER(address) LIKE ? OR LOWER(notes) LIKE ?",
        search_query, search_query, search_query
      )
    end

    # Pin type filter (multiple selection)
    if params[:pin_types].present?
      @entries = @entries.where(pin_type: params[:pin_types])
---
SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = 1 AND "entries"."pin_type" = 'Throw' ORDER BY COALESCE(found_on, '1900-01-01') DESC

  def create
    @entry = current_user.entries.new(entry_params_without_photo)

    @entry.address = MapboxReverseGeocoder.lookup(
      @entry.latitude,
      @entry.longitude
    )

    # CRITICAL: Scrub EXIF before attaching photo
    scrubbed_file = nil
    if params.dig(:entry, :photo).present?
      begin
        scrubbed_file = ExifScrubberService.scrub(params[:entry][:photo])

        # Attach the file - DON'T close it yet, Active Storage needs it during save
        @entry.photo.attach(
          io: File.open(scrubbed_file.path),
          filename: params[:entry][:photo].original_filename,
          content_type: params[:entry][:photo].content_type
        )
---
INSERT INTO "entries" ("address", "created_at", "found_on", "latitude", "longitude", "notes", "pin_type", "updated_at", "user_id", "writer_name") VALUES ('916 West Fulton Market, Chicago, Illinois 60607, United States', '2026-02-05 00:36:07.813366', '2026-02-03', 41.88676456074083, -87.65032668825941, 'TDM Crew', 'Throw', '2026-02-05 00:36:07.813366', 1, 'ALWET') RETURNING "id"

    end

    # Save the entry - temp file still exists
    if @entry.save
---
UPDATE "entries" SET "updated_at" = '2026-02-03 06:21:38.227951' WHERE "entries"."id" = 1