app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = 1 ORDER BY "entries"."created_at" DESC
---
  def index
    @entries = current_user.entries.order(created_at: :desc)

INSERT INTO "entries" ("address", "created_at", "found_on", "latitude", "longitude", "notes", "pin_type", "updated_at", "user_id", "writer_name") VALUES ('590 West Madison Street, Chicago, Illinois 60661, United States', '2026-02-04 22:16:31.654133', '2026-02-02', 41.88179230476234, -87.64275047968665, 'alwet is crazy nice.', 'Throw', '2026-02-04 22:16:31.654133', 1, 'ALWET') RETURNING "id"
---
  def create
    @entry = current_user.entries.new(entry_params)

    @entry.address = MapboxReverseGeocoder.lookup(
      @entry.latitude,
      @entry.longitude
    )

    if @entry.save

UPDATE "entries" SET "writer_name" = 'FACTS', "updated_at" = '2026-02-04 17:45:48.034145' WHERE "entries"."id" = 1
---
  def update
    if @entry.update(entry_params)

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = 1 AND "entries"."id" = 4 LIMIT 1
---
  def set_entry
    @entry = current_user.entries.find(params[:id])