app/controllers/home_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."user_id" = 1 ORDER BY "entries"."created_at" DESC
---
  def index
    @entries =
      if logged_in?
        current_user.entries.order(created_at: :desc)