app/controllers/users_controller.rb

UPDATE "users" SET "email" = 'c4ptnem0@proton.me', "updated_at" = '2026-02-02 20:38:52.872649' WHERE "users"."id" = 1
---
  def update_email
    @user = current_user

    unless @user.authenticate(params[:current_password])
      flash.now[:alert] = "Current password is incorrect"
      return render :show, status: :unprocessable_entity
    end

    if @user.update(email_params)

UPDATE "users" SET "password_digest" = '$2a$12$m2kvOLdclJ3Ybul1Ff245eTFi30WYLZ4JuG1abhySbcQXeET9967W', "updated_at" = '2026-02-02 20:39:38.950749' WHERE "users"."id" = 1
---
  def update_password
    @user = current_user

    unless @user.authenticate(params[:current_password])
      flash.now[:alert] = "Current password is incorrect"
      return render :show, status: :unprocessable_entity
    end

    if @user.update(password_params)